In [1]:
import sqlite3 as sql

In [2]:
%reload_ext sql 
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [3]:
## connect to the sqlite database 
connection=sql.connect('example.db')
connection

In [4]:
%sql sqlite:///example.db

In [5]:
cursor=connection.cursor()

In [6]:
cursor.execute('''
               Create table If Not Exists employees(
                id Integer Primary Key, 
                name Text not Null,
                age Integer,
                department text
               )''')

# need to commit the changes
connection.commit()

In [7]:
cursor.execute('select * from employees')

In [9]:
#insert the data into 
cursor.execute('''insert into employees values 
               (1,'amruth',27,'data scientist'),
               (2,'akshath',26,'mechanical engineer'),
               (3,'subhodh',25,'analyst')
               ''')

connection.commit()

In [10]:
# querying the data from sqlite3 from the table

cursor.execute('select * from employees')
rows=cursor.fetchall()

# print the query data 
for row in rows:
    print(row)

(1, 'amruth', 27, 'data scientist')
(2, 'akshath', 26, 'mechanical engineer')
(3, 'subhodh', 25, 'analyst')

In [11]:
# insert many records 
insert_records=[
    (4, 'varun', 28, 'software engineer'),
    (5, 'nisha', 24, 'business analyst'),
    (6, 'rohit', 29, 'civil engineer'),
    (7, 'kavya', 27, 'data analyst'),
    (8, 'pranav', 30, 'machine learning engineer'),
    (9, 'rakesh', 26, 'electrical engineer'),
    (10, 'megha', 25, 'marketing specialist'),
    (11, 'sanjay', 28, 'biomedical engineer'),
    (12, 'swetha', 24, 'UX designer'),
    (13, 'harish', 31, 'financial analyst'),
    (14, 'priya', 29, 'HR manager'),
    (15, 'vivek', 27, 'software developer'),
    (16, 'arjun', 26, 'project manager'),
    (17, 'anjali', 30, 'AI researcher'),
    (18, 'manoj', 25, 'cloud architect'),
    (19, 'neha', 28, 'digital marketer'),
    (20, 'yash', 32, 'cybersecurity specialist')
]

cursor.executemany('insert into employees values(?,?,?,?)',insert_records)
connection.commit()

In [12]:
# update 
cursor.execute('''update employees set age=26 where name='amruth' ''')
connection.commit()

In [13]:
%%sql  
select * from employees

 * sqlite:///example.db
Done.

[(1, 'amruth', 26, 'data scientist'),
 (2, 'akshath', 26, 'mechanical engineer'),
 (3, 'subhodh', 25, 'analyst'),
 (4, 'varun', 28, 'software engineer'),
 (5, 'nisha', 24, 'business analyst'),
 (6, 'rohit', 29, 'civil engineer'),
 (7, 'kavya', 27, 'data analyst'),
 (8, 'pranav', 30, 'machine learning engineer'),
 (9, 'rakesh', 26, 'electrical engineer'),
 (10, 'megha', 25, 'marketing specialist'),
 (11, 'sanjay', 28, 'biomedical engineer'),
 (12, 'swetha', 24, 'UX designer'),
 (13, 'harish', 31, 'financial analyst'),
 (14, 'priya', 29, 'HR manager'),
 (15, 'vivek', 27, 'software developer'),
 (16, 'arjun', 26, 'project manager'),
 (17, 'anjali', 30, 'AI researcher'),
 (18, 'manoj', 25, 'cloud architect'),
 (19, 'neha', 28, 'digital marketer'),
 (20, 'yash', 32, 'cybersecurity specialist')]

In [14]:
connection.close()